{
    "lastVersion": "1.13",
    "1.13": "> このアップデートは、Codeforces Better v1.68 - 1.74 から AtCoder Better への変更を同期します**\n\n\n\n- VJudge にジャンプするボタンを追加\n\n- \"beautify code block\" 機能を追加し、ページ上のプリコードブロックをモナコエディタに置き換えます。これにより、ダークモードでのコードの表示も改善されます\n\n- Clist Ratingの各リクエストメソッドを改善し、データが正しく取得されない問題を解決\n\n- ChatGPT翻訳のプロンプトを改善し、不完全な翻訳につながる可能性のあるインジェクションエラーを修正\n\n- LaTeXの置換/削減に関連するコードを改善し、マルチネストの場合に正しくリストアできるようになりました。正しくリストアできるようになりました。\n\n- ウェブサイトのローカリゼーションメソッドのロバスト性を強化しました。\n\n- ダークモードに関連するコードを調整し、一貫したスタイルと管理のために変数を使用するようにしました。\n\n- CDN staticfile.org を staticfile.net に置き換えました。\n\n- 問題リストページで、いくつかの問題の clist レーティングが見つからないと表示されることがある問題を修正しました。\n\n\n\n- 問題セットページで、clist スコアが異常に表示される問題を修正しました。\n\n- オンラインテストのコードで diff の比較スタイルが揃わない問題を修正\n\n- エラー報告後、deepl 429 が警告メッセージを正しく表示しない問題を修正\n\n- トピックページでクリスト評価が見つからない問題を修正\n\n- 古いバージョンの Tampermonkey で Logu のジャンプメソッドエラーを修正\n\n\n\n- MathJax ライブラリファイルが正しくロードされない問題を修正MathJax ライブラリファイルが正しく読み込まれない場合、予期しないデッドループが発生し、ページが動かなくなる問題を修正\n\n- DeepL フリーモードの翻訳で、翻訳中のプロンプトメッセージが正しく表示されない問題を修正\n\n- スクリプトが正しく読み込まれない問題を修正\n\n- 隣り合う LaTeX 数式の間のタイプミスを修正\n\n\n\n- その他いくつかの調整と改善\n\n\n\n------\n\n\n\n- サイトのローカリゼーションデータを外部 JSON に分離し、メンテナンスできるようにしました。\n\n- ローカリゼーションを自動化するためにcrowdinプラットフォームを使用している間、スクリプトは国際化をサポートします\n\n- いくつかのボタンをアイコンボタンに置き換えました\n\n- 公式api-free、api-pro、deeplxを含むDeepL APIのサポートを追加しました。提案してくれた@Vistarinに感謝します\n\n- deeplおよびchatgpt設定バランスクエリのサポートを追加しました。これは、サービスプロバイダが対応するAPIをサポートし、提供する必要があることに注意してください\n\n- 翻訳済みテキストのサポートを追加。コードスニペットのように見える場合、それは自動的に翻訳されず、翻訳をクリックする前に思い出させるためにポップアップウィンドウがあります\n\n- 翻訳サービスのターゲット言語を選択する機能を追加\n\n- チャンネルと更新のソースを更新するオプションと同様に、アバウトページを追加\n\n- キャッシュリフレッシュ、データクリア、インポートおよびエクスポートを含む、デバッグとメンテナンスのページを追加。エクスポート\n\n- カスタムオプションの追加： \"'Code editor submit button position\"、デフォルトは一番下、@lishufoodの提案に感謝\n\n- 各ローディング機能の改善、いくつかの不要な待機関係の削除、スクリプトのローディング時間の高速化\n\n- 翻訳機能に関するメソッドの改善、エラーメッセージの表示方法の改善\n\n- 自動翻訳のパフォーマンスの改善、自動翻訳ができない場合がある問題の改善。自動翻訳の問題\n\n- コードサンプルのオンライン実行に関連するコードを改善\n\n- 実行結果の差分を比較する codeDiff() メソッドを改善\n\n- 背景のコンテンツがマウスでスクロールしなくなったので、ダイアログウィンドウを改善\n\n- @lishufood さんの提案により、コードエディタを右側、下、全画面に固定したときのスタイルを改善\n\n- シンプルモードでの .html2md-panel パネルの表示効果を改善。\n\n- 設定パネルの configure ページのスタイルを改善\n\n- acmsguru のトピックタイトルページエディタエラーを修正\n\n- ウェブサイトのモバイル/デスクトップ版を切り替えた後の問題ページコードエディタエラーを修正\n\n- getMarkdown() メソッドのバグを修正。パフォーマンスの低下\n\n- 'Collapsed block auto-expand'をオフにした後、折りたたまれたブロックに翻訳ボタンが表示されないのを修正。フィードバックをくれた@MoYuToGoに感謝\n\n- \"Don't wait for page resources to fully load \"オプションの名前を変更。以前は可能だったチェックボックスの状態は、理論的に意味がないので、チェックを外すように\n\n- コードの再構築がたくさん\n\n- ** css class renaming, ** css class renaming, ** css class renaming, ** css class renaming, ** css class renaming, ** css class renaming, ** css class renaming, ** css class renaming, ** css class renaming, ** css class renaming がたくさん。\n\ncss class renaming が多いので、スタイラスのカスタムスタイルを使っている場合は微調整が必要かもしれません**\n\n- その他の微調整と改善\n\n\n\n------\n\n\n\n- ChatGPT 設定パネルが表示されないのを修正。@caoxuanming さんの提案に感謝します。liuhao6 さんの提案\n\n\n\n------\n\n\n\n- clist rating の API を v4 に更新し、タイトルページのデータ取得方法を API 経由で取得するように調整しました、@wrkwrk さんの提案に感謝します\n\n- ChatGPT 翻訳の \"Streaming Transmission\" オプションを追加、デフォルトでオン\n\n- Google の翻訳結果が空になる問題を修正しました。shicxin さんのフィードバックに感謝\n\n- \"whether to confirm code submission twice\" の設定スイッチを追加、デフォルトでオン @Rikkual さんの提案に感謝\n\n- full topic set page に small area 用のボタンを追加\n\n- full topic set page の右クリックで印刷すると翻訳結果が表示されない問題を修正 @zfs732 さんのフィードバックに感謝\n\n\n\n------\n\n\n\n- トピックページの下部にコードエディタを追加、オンラインコードテストをサポート。コードエディタ、オンラインコードテスト、コード投稿などをサポート 情報ページをお読みください\n\n- スクリプトボタンを挿入すると、翻訳結果がトピックの説明として変更される問題を修正\n\n- 組み合わせミックス管理ページの中国語版を改善\n\n- \"自動翻訳短いテキスト \"の機能を追加、デフォルトでは無効\n\n- 翻訳待機間隔の実装を改善、現在待機間隔はグローバルに有効\n\n- \"ターゲット領域の範囲を表示 \"の実装を改善 - \"ターゲット領域の範囲を表示 \"機能の実装を改善。\n\n- \"Show target area range \"の実装を改善 - ダークモードの改善、サンプル要素のホバースタイルの改善\n\n- 設定パネルオプションの追加: Translation - Filter for \\*signs in text thanks to @Dog_E, CreMicro for the feedback\n\n- \"Show loading tips \"機能をオフにした後、Crist Ratingが正しく表示されない問題を修正。Vistarin氏に感謝。\n\n- その他いくつかの改善と修正。"
}