{
    "lastVersion": "1.13",
    "1.13": "> このアップデートは、Codeforces Better v1.68 - 1.74からAtCoder Better\n\n>\n\n\n\n- VJudgeにジャンプするボタンを追加\n\n- ページ上のプリコードブロックをモナコエディタに置き換える \"beautify code blocks \"機能を追加、これによりダークモードでのコード表示も改善 - Clist Ratingの各リクエストメソッドを改善し、データが正しく取得されない問題を修正 - ChatGPT翻訳のプロンプトを改善し、翻訳の原因となるインジェクションバグの可能性を修正。これにより、ダークモードでのコードの表示も改善されます\n\n- Clist Rating の各リクエストメソッドを改善し、データを正しく取得できない問題を解決\n\n- ChatGPT 翻訳のプロンプトを改善し、翻訳が不完全になる可能性のあるインジェクションエラーを修正\n\n- LaTeX 置換/リストアに関連するコードを改善し、マルチネストの場合にコードを正しくリストアできるようになりました。restore\n\n- ウェブサイトのローカリゼーションメソッドのロバスト性を強化\n\n- 一貫したスタイルと管理のために変数を使用するようにダークモードに関連するコードを調整\n\n- CDN staticfile.org を staticfile.net に置き換える\n\n- 質問リストページで not found と表示される問題の clist レーティングを修正\n\n\n\n- 質問セットページでの clist スコアの異常を修正\n\n- オンラインテストで diff の比較スタイルが揃わない問題を修正\n\n- エラー報告後に deepl 429 のメッセージが正しく表示されない問題を修正\n\n- 問題ページで clist の評価が見つからない問題を修正\n\n- 古い Tampermonkey で Logu のジャンプメソッドエラーを修正\n\n\n\n- MathJax ライブラリファイルが正しくロードされない場合に予期しないデッドロックを修正。\n\n- DeepLフリーモードの翻訳で、翻訳中のプロンプトが正しく表示されない問題を修正\n\n- スクリプトが正しく読み込まれない問題を修正\n\n- 隣り合うLaTeX数式の間のタイプミスを修正\n\n\n\n- その他いくつかの調整と改善\n\n\n\n------\n\n\n\n- ウェブサイトのローカリゼーションデータを外部JSONから独立させ、メンテナンスを容易にしました。\n\n- スクリプトの国際化サポート、およびローカリゼーション作業を自動化するためのcrowdinプラットフォームの使用\n\n- いくつかのボタンをアイコンボタンに置き換え\n\n- 公式api-free、api-pro、およびdeeplxを含むDeepL APIのサポートを追加。提案してくれた@Vistarinに感謝\n\n- deeplおよびchatgpt設定バランスクエリのサポートを追加。これは、サービスプロバイダが対応するAPIをサポートし、提供する必要があることに注意してください\n\n- 翻訳前にテキストの判定を追加し、それがコードスニペットのように見える場合、それは自動的に翻訳されません、また、翻訳をクリックする前にポップアッププロンプトがあります\n\n- 翻訳サービスのターゲット言語を選択する機能を追加\n\n- Aboutページを追加し、チャネルを更新し、ソースを更新するオプションを追加\n\n- キャッシュリフレッシュ、データクリア、インポートおよびエクスポートを含むデバッグとメンテナンスのページを追加\n\n- カスタマイズオプションを追加。カスタムオプションの追加： \"'Code editor submit button position\", default is the bottom, thanks to @lishufood's suggestion\n\n- 各ローディング機能の改善、いくつかの不要な待機関係の削除、スクリプトのローディング時間の高速化\n\n- 翻訳機能関連のメソッドの改善、エラーメッセージの表示方法の改善\n\n- 自動翻訳のパフォーマンスの改善、自動翻訳できない可能性のある問題の改善。翻訳\n\n- コードサンプルのオンライン実行に関連するコードを改善\n\n- 実行結果の差分を比較する codeDiff() を改善\n\n- 背景のコンテンツがマウスでスクロールしないようにダイアログウィンドウを改善\n\n- コードエディタを右側、下、フルスクリーンに固定したときのスタイルを改善\n\n- .html2md-panel のシンプルモードでの表示効果を改善 - .html2md-panel のシンプルモードでの表示効果を改善。シンプルモード\n\n- 設定パネルの configure ページのスタイルを改善\n\n- acmsguru のタイトルページエディタエラーを修正\n\n- ウェブサイトのモバイル版/デスクトップ版を切り替えた後の課題ページコードエディタの問題を修正\n\n- getMarkdown() メソッドのバグを修正。\n\n\n\n劣化\n\n- 'Collapsed block auto-expand' をオフにした後、折りたたまれたブロックに翻訳ボタンが表示されない問題を修正。フィードバックをくれた @MoYuToGo に感謝\n\n- \"Don't wait for page resources to fully load\" オプションの名前を変更。css class renaming, so you may need to tweak it if you use stylus custom styles**\n\n- Some other tweaks and improvements\n\n\n\n------\n\n\n\n- 修正された ChatGPT config panel not displaying, thanks to @caoxuanming for the feedback\n\n- 追加された config switch \"Mouse Scroll Lock\" which is enabled by default, thanks to @liuhao6 for the suggestions.提案\n\n\n\n------\n\n\n\n- clist rating の API を v4 に更新し、タイトルページのデータ取得方法を API 経由で取得するように調整。@wrkwrk さんの提案に感謝\n\n- ChatGPT 翻訳の \"Streaming Transmission\" オプションを追加。デフォルトでオン\n\n- Google 翻訳の結果が空になる問題を修正。shicxin さんのフィードバックに感謝\n\n- 「コード投稿を2回確認するかどうか」の設定スイッチを追加、デフォルトでオン @Rikkual さんの提案に感謝\n\n- トピックセット全ページに小さなエリアボタンを追加\n\n- トピックセット全ページの右クリックで印刷するときに翻訳結果が表示されない問題を修正 @zfs732 さんのフィードバックに感謝\n\n\n\n------\n\n\n\n- トピックページの下部にコードエディタを追加。コードテスト、コード投稿などをサポート\n\n- スクリプトボタンを挿入すると、翻訳結果がトピックの説明として変更される問題を修正\n\n- コンボマッシュアップ管理ページの中国語版を改善\n\n- \"短いテキストを自動翻訳 \"の機能を追加、デフォルトでは無効\n\n- 翻訳待機間隔の実装を改善、待機間隔はグローバルに有効\n\n- \"ターゲット領域の範囲を表示 \"の実装を改善\n\n- ダークモードを改善、サンプル要素のホバースタイルを改善。フィードバックありがとうございました。\n\n- Settings panel option: Add Translation - Filter \\** in text, フィードバックありがとうございました。\n\n- \"Show Loading Alerts \"機能をオフにした後、Clist Ratingが正しく表示されない問題を修正。フィードバックをくれたVistarinに感謝します\n\n- その他の改善と修正"
}