{
    "saveSetting": {
        "title": "Configuration modifiée, sauvegardée ou non ?",
        "content": "",
        "buttons": [
            "non sauvé",
            "enregistrer (un fichier, etc.) (informatique)"
        ]
    },
    "update": {
        "title": "{{scriptName}} Il y a une nouvelle version !",
        "content": "** Informations sur la version：{{oldVersion}} → {{newVersion}}**\n\nNote：En raison de la politique de rafraîchissement du cache de la plateforme, lorsqu'une nouvelle version est publiée pour la première fois, la mise à jour peut encore pointer vers l'ancienne version.\n\nEn général, vous pouvez simplement cliquer sur Suspendre la mise à jour et vous ne serez plus invité à effectuer une mise à jour pour la durée de cette session de navigation jusqu'à la prochaine fois que vous rouvrirez le navigateur.\n\nVous pouvez aussi aller dans Panneau de configuration - À propos de pour basculer la source de mise à jour.",
        "buttons": [
            "Pas de mise à jour pour l'instant.",
            "mettre à jour"
        ]
    },
    "announce": {
        "title": "Mise à jour",
        "prefix": "Dernière mise à jour du journal：",
        "noContent": "\n\nIl n'y a pas de journal des modifications pour la version actuelle.",
        "divContent": "\n\nLa version beta n'a pas de changelog, [Update Commits](https://github.com/beijixiaohu/OJBetter/commits/main/)",
        "buttons": [
            "Je sais."
        ]
    },
    "skipFold": {
        "title": "Saute-t-il le bloc de pliage ?",
        "content": "La zone à traduire contient des blocs pliés, qui peuvent être des codes et n'ont généralement pas besoin d'être traduits. Vous devez maintenant choisir d'ignorer ou non ces blocs pliés：\n\nSi des blocs pliés doivent être traduits, vous pouvez les traduire plus tard en cliquant sur les boutons de traduction dans ces blocs pliés individuellement\n\nVous voulez ignorer les blocs pliés ? (il est recommandé de les sauter)",
        "buttons": [
            "bouché",
            "passer outre"
        ]
    },
    "transTextLimits": {
        "title": "Dépassement du nombre de caractères ! ",
        "content": "Le contenu à traduire a un total de **{{realTextLength}}** caractères\n\nCela dépasse la limite de **{{textLength}}** caractères du service de traduction actuel, veuillez changer de service de traduction ou activer la \"Traduction segmentée\" dans le panneau Paramètres\n\nNotez que vous avez peut-être sélectionné le mauvais bouton de traduction\n\nEn raison de la façon dont il est réalisé, il y aura plus d'un bouton de traduction dans le champ, veuillez cliquer sur le bouton Traduire dans le sous-champ le plus petit. bouton\n\nÊtes-vous sûr de vouloir continuer la traduction ?",
        "buttons": [
            "Il reste à traduire",
            "annulations"
        ]
    },
    "submitCode": {
        "title": "Confirmation de la soumission du code ?",
        "content": "",
        "buttons": [
            "annulations",
            "soumettre (un rapport, etc.)"
        ]
    },
    "isLikelyCodeSnippet": {
        "title": "La traduction se poursuivra-t-elle ?",
        "content": "La traduction à venir semble être **un extrait de code** et la traduire pourrait être inutile, êtes-vous sûr de continuer ?",
        "buttons": [
            "être",
            "bouché"
        ]
    },
    "isEmptyText": {
        "title": "La traduction se poursuivra-t-elle ?",
        "content": "Le contenu textuel de la zone sur le point d'être traduite est vide (à l'exception de la partie du bloc de code), la traduire est inutile, êtes-vous sûr de vouloir continuer ?",
        "buttons": [
            "être",
            "bouché"
        ]
    },
    "isClearDatabase": {
        "title": "La base de données est-elle vidée ?",
        "content": "Êtes-vous sûr de vouloir vider la base de données ? Elle est irrécupérable.",
        "buttons": [
            "clair",
            "annulations"
        ]
    },
    "isDeleteAllConfigSettings": {
        "title": "Réinitialise-t-il toutes les configurations ?",
        "content": "Êtes-vous sûr de vouloir réinitialiser toutes les configurations ? C'est irrécupérable.",
        "buttons": [
            "reprovision",
            "annulations"
        ]
    },
    "isImportDatabase": {
        "title": "La base de données est-elle importée ?",
        "content": "Êtes-vous sûr de vouloir importer la base de données ? Cette opération entraînera l'écrasement des données de la base existante, ce qui est irrécupérable.",
        "buttons": [
            "importation (données)",
            "annulations"
        ]
    },
    "isImportSettings": {
        "title": "Les paramètres sont-ils importés ?",
        "content": "Êtes-vous sûr de vouloir importer les paramètres ? Cela entraînera l'écrasement des données de paramétrage existantes, ce qui est irrécupérable.",
        "buttons": [
            "importation (données)",
            "annulations"
        ]
    }
}