{
    "lastVersion": "1.77.0",
    "1.77.0": "- Add \"Sample Test Result Checker\" option\n\n- Fix the issue that code block beautification doesn't switch theme correctly when dark mode is \"Follow System\"\n\n- Fix the issue that \"Review Status Text Replacement\" doesn't replace correctly\n\n- Fix the issue that Yodao translation is wrong\n\n- Fix the issue that the translation result doesn't show up in comment reply section in segmented mode\n\n- Fix the issue that the last comment is missing in the comment differentiation page\n\n- Fix the issue that LaTeX color color is overwritten in dark mode - Fix the issue that waiting interval doesn't work in \"Segmented translation\" mode - Fix the issue when querying API balance. mode when LaTeX color is overwritten\n\n- Fix the problem of waiting interval failure in \"Segmented Translation\" mode\n\n- Fix the problem when querying API balance, thanks to **@x1uc** for the contribution\n\n- Fix the problem of class name conflict in overlays\n\n- Improve the rules of localization on the website, thanks to **@xiezheyuan**, **@Acfboy** for the contribution",
    "1.76.0": "- **Replacing public library CDN with[南科大镜像 (SUSTech Mirror)](https://mirrors.sustech.edu.cn/help/cdnjs.html), for reasons see [issue](https://github.com/beijiiohu/OJBetter/issues/151)**\n\n\n\n- Add \"Evaluation Status Text Replacement\", thanks to **@wrk-123** Collaboration\n\n\n\n- Restructuring the layout of the settings page",
    "1.75.0": "- Improve some website localization rules, thanks to the contribution of **@qjwh**\n\n- Add \"ChatGPT Translation Prompt Word Customization\" and \"As System Prompt Word\" options Thanks to the collaboration of **@Dawn-Xu-helloworld**\n\n- Add \"Force Turndown Conversion\" feature. \" feature Thanks to **@wrk-123** for their contribution\n\n- Added code commit confirmation popup to show title name,\n\n- Added sample by autocommit option (off by default)\n\n- Added \"Hide title question labels\" feature (off by default)\n\n- Replaced \"Youdao Translator\" interface\n\n- Fixed gym title could not jump to vjudge\n\n- Fix `&nbsp;` symbol in code block beautification\n\n- Fix problemset source could not be submitted correctly if the length of the title number is not 1 Thanks to **@WindJ0Y** for the contribution\n\n- Fix Monaco editor not applying theme correctly when theme is set to follow Thanks to **@cscnk52 ** Contributions\n\n- Fix code editor not loading correctly when topic set title link is lowercase\n\n- Fix LaTeX not replacing correctly between lines, fix performance issue with related regulars\n\n- Fix error when retranslating \"wrap old results\"\n\n- Fix copy button not working on submission page\n\n- Fix MarkDown conversion not filtering script tags - Fix poly tagging issue with **@WindJ0Y** Thanks for contributions! script tags\n\n- Use polyfill for compatibility with browsers that don't support dialog.showModal() method (e.g. Firefox79)"
}