{
    "onload": "Attesa per il caricamento delle risorse della pagina……",
    "waiteLatex": "In attesa che la coda di rendering LaTeX sia completamente completata……",
    "linkDB": "Connessione al database……",
    "expandFoldingblocks": "Dispiegare il blocco pieghevole……",
    "commentPaging": "Essere nella pagina della sezione commenti……",
    "acmsguruRebuild": "Il questionario di redistricting div per acmsguru è in corso……",
    "initTranslateButtonFunc": "Inizializzazione della funzione del pulsante di traduzione……",
    "addConversionButton": "Pulsante di caricamento……",
    "multiChoiceTranslation": "Caricamento delle traduzioni delle selezioni……",
    "RenderPerfOpt": "Le prestazioni di rendering dei blocchi collassati sono state ottimizzate……",
    "initTransResultsRecover": "L'ultimo risultato della traduzione viene ripristinato……",
    "initTransWhenViewable": "Inizializzazione della traduzione automatica di testi brevi……",
    "recolorStandings": "Ricolorazione dell'elenco in corso……",
    "addProblemPageCodeEditor": "L'editor di codice viene aggiunto alla pagina del titolo……",
    "showRatingByClist": "Caricamento dei dati di valutazione Clist……",
    "loadSuccess": "Caricamento completato",
    "warning": {
        "is_oldLatex": "Nota：Ci sono formule LaTeX nella pagina corrente che non salvano il codice LaTeX originale (di solito si tratta di un vecchio argomento), il che impedisce allo script di tornare a LaTeX, quindi alcune delle funzionalità della pagina corrente non sono disponibili.<br>Inoltre, la funzione di traduzione della pagina corrente è implementata in modo speciale, per cui potrebbe essere mal posizionata.",
        "is_acmsguru": "Nota：La pagina corrente è un titolo acmsguru (che è un titolo molto vecchio) e alcune funzioni non sono disponibili.<br>Inoltre, la funzione di traduzione della pagina corrente è implementata in modo speciale, quindi potrebbe essere fuori luogo.",
        "trans_segment": "Attenzione! Attualmente è in modalità di traduzione segmentata, che può causare effetti negativi<p>A meno che non abbia bisogno di tradurre blog o argomenti super lunghi in questo momento, vada nelle Impostazioni e passi alla modalità Normale</p>",
        "trans_select": "Attenzione! Attualmente la modalità di traduzione Segmento Selezionato traduce solo la porzione selezionata dell'area di destinazione, faccia clic sul paragrafo per selezionarlo (riquadro arancione)<br><p>Se non ha bisogno di tradurre blog o argomenti super lunghi in questo momento, le suggeriamo di andare su Impostazioni per passare alla modalità Normale</p>",
        "is_submitPage": "Lei ha attivato l'opzione \"Aggiungi editore alla pagina del titolo\", in modo da poter inviare rapidamente la domanda in fondo alla pagina."
    },
    "error": {
        "clist": {
            "404": "Attualmente l'accesso a Clist.by è congestionato, la richiesta è stata interrotta, la preghiamo di riprovare più tardi!",
            "cookie": "Il cookie di accesso a Clist.by del suo browser attuale potrebbe non funzionare più, apra<a target='_blank' href='https://clist.by/'>Clist.by</a>per accedere nuovamente<br>Descrizione：L'implementazione dello script per la visualizzazione del punteggio di valutazione di Clist si basa sulle informazioni del cookie dell'utente connesso di Clist.by,<br>lo script non otterrà le informazioni del suo cookie specifico sul sito Clist.by, legga la pagina dello script. Per i dettagli, legga le istruzioni della pagina dello script.",
            "other": "Si è verificato un errore sconosciuto durante l'accesso a Clist.by, la richiesta è stata interrotta, la preghiamo di riprovare più tardi!"
        }
    }
}