{
    "saveSetting": {
        "title": "कॉन्फ़िगरेशन बदल दिया गया है. क्या आप इसे सहेजना चाहते हैं?",
        "content": "",
        "buttons": [
            "मत बचाओ",
            "बचाना"
        ]
    },
    "update": {
        "title": "{{scriptName}} एक नया संस्करण है!",
        "content": "**संस्करण की जानकारी：{{oldVersion}} → {{newVersion}}**\n\nनोट：प्लेटफ़ॉर्म की कैश रिफ्रेश नीति के कारण, जब एक नया संस्करण जारी किया जाता है, अपडेट अभी भी पुराने संस्करण की ओर इशारा कर रहा है,\n\nआमतौर पर आपको बस अभी अपडेट न करें पर क्लिक करना होगा और अगली बार जब आप ब्राउज़र को दोबारा नहीं खोलेंगे तब तक आपको इस ब्राउज़र सत्र के दौरान अपडेट करने के लिए प्रेरित नहीं किया जाएगा।\n\nया सेटिंग पैनल पर जाएं - अपडेट स्रोतों को स्विच करने के बारे में।",
        "buttons": [
            "अभी तक अपडेट नहीं किया गया है",
            "नवीकरण"
        ]
    },
    "announce": {
        "title": "को अद्यतन किया गया",
        "prefix": "नवीनतम अपडेट लॉग：",
        "noContent": "\n\nवर्तमान संस्करण के लिए कोई अद्यतन लॉग नहीं है",
        "divContent": "\n\nबीटा संस्करण के लिए कोई अपडेट लॉग नहीं है, [अपडेट कमिट](https://github.com/beijixiaohu/OJBetter/commits/main/)",
        "buttons": [
            "अच्छा ऐसा है"
        ]
    },
    "skipFold": {
        "title": "मुड़े हुए ब्लॉक छोड़ें?",
        "content": "अनुवाद किए जाने वाले क्षेत्र में मुड़े हुए ब्लॉक हैं। मुड़े हुए ब्लॉक कोड हो सकते हैं और आमतौर पर अनुवाद करने की आवश्यकता नहीं होती है। अब आपको यह चुनना होगा कि इन मुड़े हुए ब्लॉकों को छोड़ना है या नहीं：\n\nयदि मुड़े हुए ब्लॉक हैं जिनका आपको अनुवाद करने की आवश्यकता है, तो आप बाद में इन तहों पर अलग-अलग क्लिक कर सकते हैं।\n\nअनुवाद करने के लिए ब्लॉक के अंदर अनुवाद बटन क्या आप ढहे हुए ब्लॉक को छोड़ना चाहते हैं? (इसे छोड़ने की अनुशंसा की जाती है)",
        "buttons": [
            "नहीं",
            "इस पर से कूद जाओ"
        ]
    },
    "transTextLimits": {
        "title": "चरित्र सीमा पार हो गई! ",
        "content": "अनुवादित की जाने वाली सामग्री में कुल **{{realTextLength}}** अक्षर हैं\n\nयह वर्तमान अनुवाद सेवा की **{{textLength}}** अक्षर सीमा से अधिक है। कृपया अनुवाद सेवा बदलें, या सेटिंग पैनल में \"खंडित अनुवाद\" चालू करें\n\nध्यान दें, हो सकता है आपने गलत अनुवाद बटन चुना हो\n\nजिस तरह से इसे लागू किया गया है, उसके कारण क्षेत्र में कई अनुवाद बटन दिखाई देंगे। कृपया छोटे उप-क्षेत्र में अनुवाद बटन पर क्लिक करें\n\nक्या आप वाकई अनुवाद जारी रखना चाहते हैं ?",
        "buttons": [
            "अभी भी अनुवाद की जरूरत है",
            "रद्द करना"
        ]
    },
    "submitCode": {
        "title": "क्या आप वाकई कोड सबमिट करना चाहते हैं?",
        "content": "您要提交的题目是\n\n**{{questionTitle}}**\n\n",
        "buttons": [
            "रद्द करना",
            "जमा करना"
        ]
    },
    "isLikelyCodeSnippet": {
        "title": "क्या आप अनुवाद जारी रखना चाहते हैं?",
        "content": "अनुवादित की जाने वाली सामग्री एक **कोड स्निपेट** प्रतीत होती है। इसका अनुवाद करना निरर्थक हो सकता है। क्या आप वाकई जारी रखना चाहते हैं?",
        "buttons": [
            "हाँ",
            "नहीं"
        ]
    },
    "isEmptyText": {
        "title": "क्या आप अनुवाद जारी रखना चाहते हैं?",
        "content": "अनुवाद किए जाने वाले क्षेत्र की पाठ्य सामग्री खाली है (कोड ब्लॉक भाग को बाहर रखा गया है)। इसका अनुवाद करना अर्थहीन है। क्या आप वाकई जारी रखना चाहते हैं?",
        "buttons": [
            "हाँ",
            "नहीं"
        ]
    },
    "isClearDatabase": {
        "title": "डेटाबेस साफ़ करें?",
        "content": "क्या आप वाकई डेटाबेस साफ़ करना चाहते हैं? यह पुनर्प्राप्ति योग्य नहीं है.",
        "buttons": [
            "स्पष्ट",
            "रद्द करना"
        ]
    },
    "isDeleteAllConfigSettings": {
        "title": "सभी कॉन्फ़िगरेशन रीसेट करें?",
        "content": "क्या आप वाकई सभी कॉन्फ़िगरेशन रीसेट करना चाहते हैं? यह पुनर्प्राप्ति योग्य नहीं है.",
        "buttons": [
            "रीसेट",
            "रद्द करना"
        ]
    },
    "isImportDatabase": {
        "title": "डेटाबेस आयात करें?",
        "content": "क्या आप वाकई डेटाबेस आयात करना चाहते हैं? इससे मौजूदा डेटाबेस डेटा ओवरराइट हो जाएगा, जो पुनर्प्राप्त नहीं किया जा सकेगा।",
        "buttons": [
            "आयात",
            "रद्द करना"
        ]
    },
    "isImportSettings": {
        "title": "सेटिंग आयात करना?",
        "content": "क्या आप वाकई सेटिंग्स आयात करना चाहते हैं? इससे मौजूदा सेटिंग्स डेटा अधिलेखित हो जाएगा, जो पुनर्प्राप्त करने योग्य नहीं है।",
        "buttons": [
            "आयात",
            "रद्द करना"
        ]
    }
}