{
    "lastVersion": "1.13",
    "1.13": "> This update synchronizes changes from Codeforces Better v1.68 - 1.74 to AtCoder Better\n\n>\n\n\n\n- Added button to jump to VJudge\n\n- Added \"beautify code blocks\" feature to replace pre code blocks on the page with monaco editor, which will also improve code display in dark mode - Improved various request methods for Clist Rating to fix issues with not getting data correctly - Improved prompt for ChatGPT translations, and fixed a possible injection bug causing translations to be translated. This will also improve the display of code in dark mode\n\n- Improved each request method of Clist Rating to solve the problem of not getting the data correctly\n\n- Improved the prompt for ChatGPT translations, and fixed the problem of possible injection errors that could lead to incomplete translations\n\n- Improved the code related to the LaTeX Replacement/Restore, which now correctly restores the code in the case of multi-nesting. restore\n\n- Enhance robustness of website localization methods\n\n- Adjust code related to Dark Mode to use variables for consistent style and management\n\n- Replace CDN staticfile.org with staticfile.net\n\n- Fix clist ratings for some questions on question list page that may show not found\n\n\n\n- Fix anomaly in clist scores on question set pages\n\n- Fix diff comparison style not aligned in code online test\n\n- Fix deepl 429 not displaying message correctly after reporting error\n\n- Fix clist rating may not be found on question page\n\n- Fix Logu jump method error in old Tampermonkey\n\n\n\n- Fix unexpected deadlock when MathJax library file is not loaded correctly. and an unexpected dead loop would occur causing the page to get stuck\n\n- Fixed DeepL free mode translations not displaying the in-translation prompts correctly\n\n- Fixed scripts that might not load correctly\n\n- Fixed typos between adjacent LaTeX formulas that could be broken\n\n\n\n- Some other tweaks and improvements\n\n\n\n------\n\n\n\n- Separated website localization data into external JSON for easier maintenance\n\n- Scripts support internationalization while using the crowdin platform to automate localization efforts\n\n- Replaced some buttons with icon buttons\n\n- Added support for the DeepL API, including the official api-free, api-pro, and deeplx, thanks to @Vistarin for the suggestion\n\n- Added support for deepl and chatgpt configuration balance queries. Note that this also requires your service provider to support and provide the corresponding API\n\n- Add judgment on the text before translation, if it looks like a code snippet, it won't be translated automatically, and there will also be a popup window prompting before clicking translate\n\n- Add the function of selecting the target language of the translation service\n\n- Add the about page, as well as the option of updating the channel and the source of the update\n\n- Add the page of debugging and maintenance, including cache refreshing, data clearing, and import and export\n\n- Add customization options. Add customization options： \"'Code editor submit button position\", default is the bottom, thanks to @lishufood's suggestion\n\n- Improve each loading function, remove some unnecessary waiting relationships, speed up script loading time\n\n- Improve the translation function related methods, and the way of displaying error messages\n\n- Improve the performance of auto-translation, and the problem that may not be able to be automatically translation\n\n- Improve code related to running code samples online\n\n- Improve codeDiff() for comparing difference of running results\n\n- Improve dialog window as background content no longer scrolls with mouse\n\n- Improve code editor style when fixing it to the right side, bottom, and full-screen, thanks to @lishufood\n\n- Improve display effect of .html2md-panel panel in simple mode\n\n- Improve the style of configuration page in Settings panel\n\n- Fix acmsguru title page editor error\n\n- Fix issue with issue page code editor after switching between mobile/desktop version of website\n\n- Fix a bug in getMarkdown() method that incorrectly stores data directly into DOM, resulting in a performance degradation\n\n- Fixed translation buttons in collapsed blocks not showing up after turning off 'Collapsed block auto-expand', thanks to @MoYuToGo for the feedback\n\n- Renamed the \"Don't wait for page resources to fully load\" option to uncheck it since it was theoretically meaningless\n\n- Tweaked a lot of the code structure\n\n- **A lot of the css class renaming, so you may need to tweak it if you use stylus custom styles**\n\n- Some other tweaks and improvements\n\n\n\n------\n\n\n\n- Fixed ChatGPT config panel not displaying, thanks to @caoxuanming for the feedback\n\n- Added a config switch \"Mouse Scroll Lock\" which is enabled by default, thanks to @liuhao6 for the Suggestions\n\n\n\n------\n\n\n\n- Update the API of clist rating to v4, adjust the data fetching method of title page to be fetched via API, thanks to @wrkwrk's suggestion\n\n- Add ChatGPT translation \"Streaming Transmission\" option, on by default\n\n- Fix the problem that Google translation result is empty. Thanks to @shicxin for his feedback\n\n- Add a configuration switch \"whether to confirm code submission twice\", on by default Thanks to @Rikkual for his suggestion\n\n- Add a button for small area in the full topic set page\n\n- Fix the problem that the translation result is not shown when printing on the right click of the full topic set page Thanks to @zfs732 for his feedback\n\n\n\n------\n\n\n\n- Add a code editor at the bottom of the topic page to support online code testing, code submission and so on. code testing, code submission, etc. Please read the information page\n\n- Fix the problem that inserting script button and translation result will be changed as topic description\n\n- Improve the Chineseization of combo mashup management page\n\n- Add the function of \"auto-translate short text\", disabled by default\n\n- Improve the implementation of translation waiting interval, now the waiting interval is effective globally\n\n- Improve the implementation of \"show target area range\"\n\n- Improve the dark mode, improve the hover of sample elements. and improve hover style of sample elements, thanks to @SUPERLWR for feedback\n\n- Add settings panel option: Translation - Filter \\*\\* in text, thanks to @Dog_E, CreMicro for feedback\n\n- Fixed the issue that Clist Rating can't be displayed correctly after turning off the \"Show Loading Alerts\" option. Thanks to Vistarin for the feedback\n\n- Some other improvements and fixes"
}