{
    "lastVersion": "1.20.0",
    "1.20.0": "- Added \"Translation Text Color\" customization feature, you can configure the text color of translation result in settings, thanks to the contribution of **@wrk-123**\n\n- Added Ctrl+Enter shortcut to submit code, thanks to the contribution of **@wrk-123**\n\n- Fixed the problem of ` <br>` line breaks missing in MarkDown conversion, thanks to the contribution of **@wrk-123** - Fixed the problem of characters being escaped by HTML (e.g. ` ` ` `) when copying MarkDown. Contributions\n\n- Fix HTML escaping of characters when copying MarkDown (e.g. `&lt;` `&gt;`), thanks to **@wrk-123** Contributions\n\n- Fix not filtering ` <style>` tags when converting MarkDown\n\n- Fix Chinese bracket substitution rule that causes syntax errors in Markdown links, thanks to **@wrk-123** Contributions\n\n- Fix HTTP status code loss in YouDao Translator. HTTP status code judgment logic for Youdao Translator, thanks to **@wrk-123** for contributing\n\n- Fix CloudFlare human validation issue, thanks to **@wrk-123** for contributing\n\n- Fix redundant hierarchy changes, thanks to **@wrk-123** for contributing\n\n- Improvement of button element by adding `type='button'` attribute to avoid form mis-submission\n\n- Improve translation copy button prompt text in disabled state\n\n- Improve code submission form construction, simplify code structure\n\n- Improve topic not found decision for jumping to Luogu, thanks to **@wrk-123**'s contribution\n\n- Improve website localization rules, thanks to **@qjwh**, **@nr0728**, **@wrk-123**'s contribution Contributions",
    "1.19.0": "- Removed dependency on Greasyfork script repository\n\n- Changed default update source to AliCloud OSS\n\n- Fixed issue with incorrectly styled buttons on some title pages\n\n- Improvements：Adjustments to GPT default prompt words",
    "1.18.0": "- Add \"Sample test result checker\" option\n\n- Add \"Show list of same topic\" function, thanks to the contribution of **@wrk-123**\n\n- Fix the problem that code block beautification didn't switch the topic correctly when the dark mode is \"Follow system\"\n\n- Fix the problem of Arigatou Translation Error\n\n- Fix the problem of waiting interval failure in \"Segmented Translation\" mode\n\n- Fix the problem that exists when querying API balance. Thanks to the contribution of **@x1uc**\n\n- Fix the problem of overlay class name conflict\n\n- Improve the website localization rules, thanks to the contribution of **@nr0728**, **@user111192**, **@qjwh**."
}