{
    "lastVersion": "1.74.0",
    "1.74.0": "- VJudge로 이동하는 버튼 추가\n\n- 페이지의 사전 코드 블록을 모나코 에디터로 대체하는 \"코드 블록 미화\" 기능 추가, 다크 모드에서 코드 표시도 개선\n\n- Clist Rating의 각 요청 방법을 개선하여 데이터를 제대로 가져오지 않는 문제 해결\n\n- ChatGPT 번역 프롬프트 개선 및 불완전한 번역 결과를 초래하는 주입 오류 문제 수정. ChatGPT 번역에 대한 프롬프트 개선 및 불완전한 번역 결과를 초래할 수 있는 주입 오류 수정\n\n- 다중 중첩 시 올바르게 복원되는 LaTeX 대체/복원 관련 코드 개선\n\n- 텍스트가 코드 조각인지 확인하는 방법 개선\n\n- 웹사이트 현지화 방법의 견고성 강화\n\n- 일관된 스타일 및 관리를 위해 변수를 사용하는 다크 모드 관련 코드 조정 - 다크 모드에서 코드 표시가 개선되는 다크 모드 관련 코드 교체\n\n- 일관된 스타일 및 관리를 위해 CDN staticfile.org를 staticfile.net으로 대체\n\n- 마크다운 데이터에 더 이상 선형 코드 블록이 포함되지 않음\n\n- 문제 목록 페이지에서 일부 문제의 채점 등급이 찾을 수 없음으로 표시되는 문제 수정\n\n\n\n- 문제 세트 페이지의 채점 점수 이상 수정\n\n- 코드가 정렬되지 않는 문제 수정 차이 비교 스타일이 정렬되지 않음\n\n- 오류보고 후 경고 메시지가 올바르게 표시되지 않는 deepl 429 수정\n\n- 문제 페이지에서 Clist 등급이 찾을 수없는 것으로 표시 될 수있는 문제 수정\n\n- 이전 버전의 Tampermonkey에서 Logu 점프 방법 오류 수정\n\n\n\n- MathJax 라이브러리 파일이 제대로로드되지 않을 때 예상치 못한 데드 루프 수정 결과 페이지 멈춤\n\n- DeepL 무료 모드 번역에서 번역 중 메시지가 올바르게 표시되지 않는 문제 수정\n\n- 스크립트가 올바르게 로드되지 않는 문제 수정\n\n- 인접한 라텍스 수식 사이의 깨진 타이포그래피 수정\n\n\n\n- 기타 조정 및 개선 사항",
    "1.73.0": "- 웹사이트 현지화 데이터를 외부 JSON과 독립적으로 만들어 유지보수 용이\n\n- 스크립트가 국제화를 지원하는 동시에 크라우드인 플랫폼을 사용하여 현지화를 자동화\n\n- 일부 버튼을 아이콘 버튼으로 교체\n\n- 공식 api-free, api-pro 및 deeplx를 포함한 DeepL API 지원 추가, @Vistarin의 제안에 감사\n\n- 다음에 대한 지원 추가 deepl 및 chatgpt 구성 잔액 쿼리 지원, 서비스 제공 업체가 해당 API를 지원하고 제공해야 함에 유의\n\n- 사전 번역 된 텍스트 지원 추가, 코드 조각처럼 보이는 경우 자동으로 번역되지 않으며 번역 버튼을 클릭하기 전에 팝업 창이 표시됩니다\n\n- 번역 서비스의 대상 언어 선택 기능 추가\n\n- 정보 페이지 추가, 채널 업데이트 옵션 및 업데이트 소스 추가\n\n- 추가 캐시 새로 고침, 데이터 지우기, 가져오기 및 내보내기를 포함한 디버깅 유지 관리 페이지 추가\n\n- 사용자 지정 옵션 추가： '코드 편집기 제출 버튼 위치', @lishufood의 제안 덕분에 기본값은 하단에 있습니다\n\n- 각 로딩 기능 개선, 불필요한 대기 관계 제거, 스크립트 로딩 시간 단축\n\n- 번역 기능의 방법 개선 메서드 및 오류 메시지 표시 방법 개선\n\n- 자동 번역 성능 개선 및 자동 번역이 되지 않는 문제 개선\n\n- 코드 샘플의 온라인 실행 관련 코드 개선\n\n- 실행 결과의 차이 비교 방법, codeDiff() 개선\n\n- 배경 콘텐츠가 더 이상 마우스와 함께 스크롤되지 않도록 대화창 개선\n\n- 코드 에디터의 스타일을 오른쪽, 하단, 전체 화면으로 고정했을 때 개선 @lishufood의 제안 덕분에 코드 에디터의 스타일이 더 잘 보이도록 했습니다. 제안해 주신 @lishufood님께 감사드립니다\n\n- 단순 모드에서 .html2md 패널 패널 표시 개선\n\n- 설정 패널에서 구성 페이지 스타일 개선\n\n- acmsguru 제목 페이지 편집기 오류 수정\n\n- 모바일/데스크톱 버전의 사이트 간 전환 후 이슈 페이지 코드 편집기 문제 수정\n\n- 수정된 데이터를 DOM에 직접 잘못 저장하여 페이지 성능 저하를 초래하는 getMarkdown() 메서드 수정\n\n- @MoYuToGo 덕분에 '접힌 블록 자동 확장'을 끈 후 접힌 블록의 번역 버튼이 표시되지 않는 문제 수정\n\n- '페이지 리소스가 완전히로드 될 때까지 기다리지 않음'옵션이 이론적으로 비활성화되었으므로 '페이지 리소스가 완전히로드 될 때까지 기다리지 않음 \" 옵션은 이론적으로 의미가 없으며 이전에 가능한 확인 상태를 제거하도록 이름이 변경되었습니다\n\n- 많은 코드 구조 조정\n\n- **많은 CSS 클래스 이름 변경, 스타일을 사용자 정의 스타일을 사용하는 경우 조정해야 할 수 있습니다**\n\n- 몇 가지 다른 조정 및 개선 사항",
    "1.72.0": "- 피드백을 보내주신 @caoxuanming님께 감사드립니다.\n\n- @liuhao6님의 제안으로 \"마우스 스크롤 잠금\" 구성 스위치를 기본적으로 켜도록 수정했습니다."
}