{
    "lastVersion": "1.80.0",
    "1.80.0": "- Hinzufügen der benutzerdefinierten Funktion \"Textfarbe übersetzen\", Sie können die Textfarbe des Übersetzungsergebnisses in den Einstellungen konfigurieren, dank des Beitrags von **@wrk-123**\n\n- Hinzufügen des Bestätigungsdialogs \"Codeblock überspringen\" beim Übersetzen, um eine Fehlübersetzung des Codeinhalts zu vermeiden\n\n- Hinzufügen der Tastenkombination Strg+Eingabe, um Code zu übermitteln, dank des Beitrags von **@wrk-123**\n\n- Beheben des Problems, dass ` ` Zeilenumbrüche bei der Konvertierung von MarkDown verloren gehen, dank des Beitrags von **@wrk-123** - Beheben des Problems, dass ` ` Zeilenumbrüche beim Kopieren von MarkDown verloren gehen. <br> ` fehlende Zeilenumbrüche bei MarkDown-Konvertierungen, Dank an **@wrk-123** für den Beitrag\n\n- Behebt das HTML-Escaping von Zeichen beim Kopieren von MarkDown (z.B. `&lt;` `&gt;`), Dank an **@wrk-123** für den Beitrag\n\n- Behebt Zeilenumbrüche in Codeblöcken (` <pre>`) bei MarkDown-Konvertierungen, Dank an **@wrk-123* für den Beitrag - Behebt Zeilenumbrüche bei MarkDown-Konvertierungen, Dank an **@wrk-123* für den Beitrag - Behebt die Tastenkombination Strg+Eingabe zum Übermitteln von Code, um zu verhindern, dass Code-Inhalte versehentlich übersetzt werden. **@wrk-123** Beitrag\n\n- Fix ` <style>` tag not filtered in MarkDown conversion\n\n- Fix Chinese bracket substitution rule causing Markdown link syntax error, thanks to **@wrk-123** Beitrag\n\n- Fix HTTP status code judgement logic of Youdao Translator, thanks to **@wrk-123** Beitrag\n\n- Fix PP case matching issue, thanks to **@wrk-123** Beitrag Beitrag von @awerty-noob**\n\n- Behebung des Problems mit redundanten Ebenenwechseln, dank dem Beitrag von **@wrk-123**\n\n- Verbesserung der Robustheit der MathJax-Elementerkennung, Unterstützung von mehr MathJax-Klassennamen-Varianten, dank dem Beitrag von **@wrk-123**\n\n- Verbesserung der Anzeigelogik der Funktion zur Verschönerung von Blöcken, zeigt nicht mehr die Codeblöcke an, die ursprünglich ausgeblendet waren. Dank an **@wrk-123** für seinen Beitrag\n\n- Verbesserung der Hinzufügung des Attributs `type='button'` zum Button-Element, um Formular-Fehlübertragungen zu vermeiden\n\n- Verbesserung der Übersetzungs-Kopie des Prompt-Textes des Buttons im deaktivierten Zustand\n\n- Verbesserung der Bestimmung des nicht gefundenen Themas beim Sprung zu Luogu, Dank an **@wrk-123** für seinen Beitrag\n\n- Verbesserung der Website-Lokalisierungsregeln, Dank an **@qjwh** **@wrk-123** für den Beitrag!",
    "1.79.0": "- Abhängigkeit von Greasyfork Skript-Repository entfernt\n\n- Standard-Update-Quelle auf AliCloud OSS geändert\n\n- Problem mit falsch gestylten Schaltflächen auf einigen Titelseiten behoben\n\n- Verbesserungen：GPT-Standardaufforderungen angepasst\n\n- Verbesserungen：Zeigt deutlich an, wenn der Online-Code ausläuft",
    "1.77.0": "\n\n\n\n\n\n\n\n\n\n\n\n- Hinzufügen der Option \"Sample Test Result Checker\" - Behebung des Problems, dass die Codeblock-Verschönerung das Thema nicht korrekt wechselt, wenn der dunkle Modus auf \"Follow System\" eingestellt ist - Behebung des Problems, dass \"Review Status Text Replacement\" nicht korrekt ersetzt - Behebung des Problems, dass die Yodao-Übersetzung falsch ist - Behebung des Problems, dass das Übersetzungsergebnis im segmentierten Modus nicht im Kommentar-Antwort-Bereich angezeigt wird - Behebung des Problems, dass der letzte Kommentar auf der Kommentar-Differenzierungsseite fehlt - Behebung des Problems, dass die LaTeX-Farbe im dunklen Modus überschrieben wird - Behebung des Problems, dass das Warteintervall im Modus \"Segmented Translation\" nicht funktioniert.\n\n\n\n\n\n\n\nBehebt das Problem, dass die LaTeX-Farbe im dunklen Modus überschrieben wird - Behebt das Problem, dass das Warteintervall im Modus \"Segmentierte Übersetzung\" nicht funktioniert - Behebt das Problem mit der Abfrage der API-Balance, dank **@x1uc** - Behebt den Konflikt mit dem Namen der Overlay-Klasse - Verbessert die Lokalisierungsregeln der Website, dank **@xiezheyuan**, **@Acfboy**."
}