{
    "onload": "पृष्ठ संसाधनों के लोड होने की प्रतीक्षा……",
    "waiteLatex": "LaTeX रेंडरिंग कतार के……पूरा होने की प्रतीक्षा की जा रही है",
    "linkDB": "डेटाबेस से कनेक्ट करना……",
    "expandFoldingblocks": "ढहे हुए ब्लॉक का विस्तार……",
    "commentPaging": "टिप्पणियों को पेज……में अलग करना",
    "acmsguruRebuild": "acmsguru प्रश्न सतह के लिए div……को पुनः विभाजित करना",
    "initTranslateButtonFunc": "अनुवाद बटन फ़ंक्शन प्रारंभ करना……",
    "addConversionButton": "लोड हो रहा है बटन……",
    "multiChoiceTranslation": "अंश अनुवाद लोड हो रहा है……",
    "RenderPerfOpt": "संक्षिप्त ब्लॉक रेंडरिंग प्रदर्शन को अनुकूलित करना……",
    "initTransResultsRecover": "अंतिम अनुवाद परिणाम……पुनर्स्थापित करना",
    "initTransWhenViewable": "लघु पाठ स्वचालित अनुवाद प्रारंभ करना……",
    "recolorStandings": "पुनःरंग सूची……",
    "addProblemPageCodeEditor": "शीर्षक पृष्ठ……पर कोड संपादक जोड़ा जा रहा है",
    "showRatingByClist": "क्लिस्ट रेटिंग डेटा लोड हो रहा है……",
    "loadSuccess": "लोडिंग पूरी हो गई",
    "warning": {
        "is_oldLatex": "：: वर्तमान पृष्ठ में LaTeX सूत्र हैं जो मूल LaTeX कोड को सहेजते नहीं हैं (यह आमतौर पर एक पुराना प्रश्न है)। इसके कारण स्क्रिप्ट इसे वापस LaTeX पर पुनर्स्थापित करने में असमर्थ हो जाती है, इसलिए वर्तमान पृष्ठ के कुछ फ़ंक्शन लागू नहीं होते हैं।<br>इसके अलावा, वर्तमान पृष्ठ का अनुवाद फ़ंक्शन एक विशेष कार्यान्वयन पद्धति को अपनाता है, इसलिए टाइपोग्राफी का गलत संरेखण हो सकता है।",
        "is_acmsguru": "नोट：वर्तमान पृष्ठ एक एसीएमएसगुरु प्रश्न है (यह एक बहुत पुराना प्रश्न है), और कुछ फ़ंक्शन लागू नहीं हैं।<br>इसके अलावा, वर्तमान पृष्ठ का अनुवाद फ़ंक्शन एक विशेष कार्यान्वयन पद्धति को अपनाता है, इसलिए टाइपोग्राफी का गलत संरेखण हो सकता है।",
        "trans_segment": "सूचना! यह वर्तमान में खंडित अनुवाद मोड में है, जो नकारात्मक प्रभाव पैदा करेगा।<p>जब तक आपको अभी बहुत लंबे ब्लॉग या प्रश्न का अनुवाद करने की आवश्यकता नहीं है, कृपया सामान्य मोड पर स्विच करने के लिए सेटिंग्स पर जाएं</p>",
        "trans_select": "सूचना! वर्तमान में चयनित अनुवाद मोड में, केवल लक्ष्य क्षेत्र में चयनित भाग का अनुवाद किया जाएगा। इसे चुनने के लिए पैराग्राफ पर क्लिक करें (नारंगी बॉक्स)<br><p>यदि आपको अब बहुत लंबे ब्लॉग या प्रश्नों का अनुवाद करने की आवश्यकता नहीं है, तो यह अनुशंसा की जाती है कि आप सेटिंग्स में जाएं और सामान्य मोड</p>पर स्विच करें",
        "is_submitPage": "आपने \"प्रश्न पृष्ठ पर संपादक जोड़ें\" विकल्प चालू कर दिया है, और आप इसे प्रश्न पृष्ठ के नीचे तुरंत सबमिट कर सकते हैं।"
    },
    "error": {
        "clist": {
            "404": "Clist.by की वर्तमान पहुंच नेटवर्क भीड़ के कारण है और अनुरोध बाधित हो गया है। कृपया बाद में पुनः प्रयास करें।",
            "cookie": "वर्तमान ब्राउज़र की Clist.by लॉगिन कुकी समाप्त हो गई है, कृपया<a target='_blank' href='https://clist.by/'>Clist.by खोलें</a>फिर से लॉग इन करें<br>विवरण：स्क्रिप्ट का Clist रेटिंग उप-डिस्प्ले कार्यान्वयन Clist.by की लॉगिन उपयोगकर्ता कुकी जानकारी पर निर्भर करता है।<br>स्क्रिप्ट आपकी लॉगिन जानकारी प्राप्त नहीं करेगी। Clist.by साइट पर विशिष्ट कुकी जानकारी के लिए, कृपया स्क्रिप्ट पृष्ठ पर दिए गए निर्देश पढ़ें।",
            "other": "Clist.by तक पहुँचने के दौरान एक अज्ञात त्रुटि उत्पन्न हुई। अनुरोध बाधित हो गया है। कृपया बाद में पुनः प्रयास करें।"
        }
    }
}