{
    "chatgpt": {
        "title": "विन्यास",
        "basic": {
            "title": "बुनियादी",
            "name": {
                "label": "नाम:",
                "placeholder": "कृपया इस कॉन्फ़िगरेशन को एक नाम दें"
            },
            "model": {
                "label": "नमूना:",
                "tipText": "यदि <p>को खाली छोड़ दिया जाता है, तो यह डिफ़ॉल्ट रूप से：gpt-3.5-टर्बो</p><p>मॉडल सूची के लिए, कृपया<a target=\"_blank\" href=\"https://platform.openai.com/docs/models\">OpenAI आधिकारिक दस्तावेज</a></p><p><strong>देखें। इसके अलावा, यदि आप सेवा प्रदाता द्वारा प्रदान की गई प्रॉक्सी एपीआई का उपयोग कर रहे हैं, तो कृपया पुष्टि करें कि सेवा प्रदाता संबंधित मॉडल</strong>का समर्थन करता है या</p>"
            },
            "key": {
                "label": "चाबी:",
                "placeholder": "कृपया कुंजी दर्ज करें",
                "tipText": "<p>अपनी स्वयं की OpenAI कुंजी दर्ज करनी होगी,<a target=\"_blank\" href=\"https://platform.openai.com/account/usage\">वेबसाइट</a></p><p><b>यदि आप सेवा प्रदाता द्वारा प्रदान की गई प्रॉक्सी एपीआई का उपयोग कर रहे हैं, तो आपको सेवा प्रदाता द्वारा प्रदान की गई कुंजी</b></p>भरनी चाहिए"
            },
            "proxy": {
                "label": "प्रॉक्सी एपीआई:",
                "tipText": "यदि <p>को खाली छोड़ दिया जाता है, तो यह ओपनएआई आधिकारिक एपीआई के लिए डिफ़ॉल्ट है।</p><p>आप ओपनएआई के एपीआई तक प्रॉक्सी पहुंच के लिए निर्दिष्ट एपीआई भी भर सकते हैं।</p><p>यदि आप सेवा प्रदाता द्वारा प्रदान की गई प्रॉक्सी एपीआई और कुंजी का उपयोग कर रहे हैं, तो आपको ऐसा करना चाहिए यहां इसके द्वारा दिए गए<strong>पूर्ण विवरण भरें।</strong>एपीआई पता, विवरण के लिए कृपया स्क्रिप्ट विवरण पढ़ें</p><p><strong>चूंकि आपने एक कस्टम एपीआई निर्दिष्ट किया है, टैम्परमॉन्की आपको क्रॉस-डोमेन अनुरोधों के बारे में चेतावनी देगा, और आपको खुद को अधिकृत करने की आवश्यकता है</strong></p>"
            }
        },
        "advanced": {
            "title": "विकसित",
            "header": {
                "label": "कस्टम हेडर",
                "placeholder": "(वैकल्पिक) आप यहां अनुरोध शीर्षलेख में जोड़ने के लिए अतिरिक्त कुंजी-मूल्य जोड़े भर सकते हैं।",
                "tipText": "<p>प्रारूप उदाहरण：</p><div style=\"border: 1px solid #795548; padding: 10px;\"><p>नाम1 : 123<br>नाम2 : सीसीसीसी</p></div>"
            },
            "data": {
                "label": "कस्टम डेटा",
                "placeholder": "(वैकल्पिक) आप यहां अनुरोध डेटा में जोड़ने के लिए अतिरिक्त कुंजी-मूल्य जोड़े भर सकते हैं।",
                "tipText": "<p>प्रारूप उदाहरण：</p><div style=\"border: 1px solid #795548; padding: 10px;\"><p>नाम1 : 123<br>नाम2 : सीसीसीसी</p></div>"
            }
        }
    },
    "complet": {
        "title": "कस्टम पूर्णता",
        "name": {
            "label": "टिप्पणी:",
            "placeholder": "कृपया इस कस्टम कॉन्फ़िगरेशन को एक टिप्पणी नाम दें"
        },
        "choose": {
            "label": "सक्षम करना?"
        },
        "genre": {
            "label": "टेम्पलेट प्रारूप",
            "tipText": "<p>मोनाको प्रारूप मोनाको में <a target=\"_blank\" href=\"https://microsoft.github.io/monaco-editor/docs.html#interfaces/languages.CompletionItem.html\">कंप्लीशनआइटम</a> की लगभग सभी विशेषताओं का समर्थन करता है, (ध्यान दें: रेंज विशेषता की आवश्यकता नहीं है, स्क्रिप्ट स्वचालित रूप से गणना करेगी और इस विशेषता को जोड़ेगी)</p><p>ऐस प्रारूप केवल ऐस में पूर्णकर्ताओं की सीमित विशेषताओं का समर्थन करता है: <code>कैप्शन</code>,<code>मान</code>, स्क्रिप्ट स्वचालित रूप से इसे मोनाको प्रारूप</p><p>में परिवर्तित कर देगी। विवरण के लिए, आप स्क्रिप्ट पृष्ठ</p>पर दिए गए निर्देशों को पढ़ सकते हैं।"
        },
        "language": {
            "label": "लागू भाषाएँ"
        },
        "jsonurl": {
            "tipText": "<p>OJBetter_Bridge खोलने के बाद, यह GET अनुरोध<code>/mycomplet/*</code>का जवाब देगा और फ़ाइल की सामग्री को<code>mycomplet</code>फ़ोल्डर में पाए गए समान नाम के साथ वापस कर देगा</p><p>इसलिए आपको केवल अपनी फ़ाइल को <code>/ में रखना होगा mycomplet</code> फ़ोल्डर JSON फ़ाइल को स्थानीय रूप से एक्सेस किया जा सकता है।</p><p>कॉन्फ़िगरेशन में आपको जिस URL को भरने की आवश्यकता है वह फॉर्म में है: </p><p><code>http://127.0.0.1:2323/mycomplet/xxx.json</code></p>",
            "alert": "<p>अतिरिक्त चेकसम जांच किए बिना स्क्रिप्ट आपके JSON डेटा पर पूरी तरह से भरोसा करेगी, इसलिए कृपया अज्ञात स्रोतों से JSON URL न जोड़ें।</p><p>विशेष रूप से निर्मित डेटा स्क्रिप्ट के सामान्य कामकाज को नष्ट कर सकता है, या यहां तक कि अन्य दुर्भावनापूर्ण कोड को भी निष्पादित कर सकता है</p>",
            "placeholder": "यह http://127.0.0.1:2323/mycomplet/xxx.json जैसा दिखता है"
        }
    }
}