{
    "lastVersion": "1.13",
    "1.13": "> 이 업데이트는 Codeforces Better v1.68 - 1.74의 변경 사항을 AtCoder Better와 동기화합니다\n\n>\n\n\n\n- VJudge로 이동하는 버튼 추가\n\n- 페이지의 사전 코드 블록을 모나코 에디터로 대체하는 \"코드 블록 미화\" 기능 추가, 다크 모드에서 코드 표시도 개선됩니다 - 데이터를 제대로 가져오지 못하는 문제를 해결하기 위해 Clist Rating의 다양한 요청 방법을 개선했습니다 - ChatGPT 번역 프롬프트 개선 및 번역을 유발하는 가능한 주입 버그가 수정되었습니다.\n\n- 데이터를 올바르게 가져오지 못하는 문제를 해결하기 위해 Clist Rating의 각 요청 방법을 개선했습니다.\n\n- ChatGPT 번역 프롬프트를 개선하고 불완전한 번역으로 이어질 수 있는 주입 오류를 수정했습니다.\n\n- LaTeX 교체/복원 관련 코드를 개선하여 이제 다중 중첩의 경우 코드를 올바르게 복원할 수 있습니다. 복원\n\n- 웹사이트 현지화 방법의 견고성 향상\n\n- 일관된 스타일 및 관리를 위해 변수를 사용하도록 다크 모드 관련 코드 조정\n\n- CDN staticfile.org를 staticfile.net으로 교체\n\n- 문제 목록 페이지에서 일부 문제의 클리스트 등급이 찾을 수 없음으로 표시되는 문제 수정\n\n\n\n- 문제 세트 페이지의 클리스트 점수 이상 현상 수정\n\n- 코드 온라인 테스트에서 차이점 비교 스타일이 정렬되지 않는 문제 수정\n\n- 오류 보고 후 메시지가 올바르게 표시되지 않는 문제 수정\n\n- 문제 페이지에서 클리스트 등급을 찾을 수 없는 문제 수정\n\n- 이전 탐머몽키의 로구 점프 방법 오류 수정\n\n\n\n- MathJax 라이브러리 파일이 올바르게 로드되지 않을 때 예기치 않은 데드락 수정. 예기치 않은 데드 루프가 발생하여 페이지가 멈추는 문제 수정\n\n- DeepL 무료 모드 번역에서 번역 중 프롬프트가 올바르게 표시되지 않는 문제 수정\n\n- 올바르게 로드되지 않을 수 있는 스크립트 수정\n\n- 인접한 LaTeX 수식 사이의 오타 수정\n\n\n\n- 기타 조정 및 개선\n\n\n\n------\n\n\n\n- 웹사이트 현지화 데이터를 외부 JSON과 독립적으로 만들어 유지 관리가 용이하도록 했습니다.\n\n- 스크립트에 대한 국제화 지원 및 크라우드인 플랫폼을 사용하여 현지화 작업을 자동화\n\n- 일부 버튼을 아이콘 버튼으로 교체\n\n- 공식 api-free, api-pro 및 deeplx를 포함한 DeepL API에 대한 지원 추가, @Vistarin의 제안 덕분에\n\n- deepl 및 chatgpt 구성 잔액 쿼리에 대한 지원 추가. 서비스 제공업체에서 해당 API를 지원하고 제공해야 합니다\n\n- 번역 전 텍스트에 대한 판단 추가, 코드 조각처럼 보이는 경우 자동으로 번역되지 않으며 번역을 클릭하기 전에 팝업 메시지가 표시됩니다\n\n- 번역 서비스의 대상 언어 선택 기능 추가\n\n- 정보 페이지 및 채널 업데이트, 소스 업데이트 옵션 추가\n\n- 캐시 새로 고침, 데이터 지우기, 가져오기 및 내보내기 등 디버깅 및 유지 관리 페이지 추가\n\n- 사용자 지정 옵션 추가. 사용자 지정 옵션 추가： \"'코드 편집기 제출 버튼 위치\", @lishufood의 제안으로 기본값은 하단\n\n- 각 로딩 기능 개선, 불필요한 대기 관계 제거, 스크립트 로딩 시간 단축\n\n- 번역 기능 관련 방법 및 오류 메시지 표시 방법 개선\n\n- 자동 번역 성능 개선 및 자동으로 되지 않을 수 있는 문제 수정 번역\n\n- 온라인에서 코드 샘플 실행 관련 코드 개선\n\n- 실행 결과의 차이 비교를 위한 codeDiff() 개선\n\n- 배경 콘텐츠가 더 이상 마우스로 스크롤되지 않도록 대화창 개선\n\n- @lishufood 덕분에 코드 편집기를 오른쪽, 하단, 전체 화면으로 수정할 때 스타일 개선\n\n- .html2md 패널 패널의 표시 효과를 개선합니다. 단순 모드\n\n- 설정 패널에서 페이지 구성 스타일 개선\n\n- acmsguru 제목 페이지 편집기 오류 수정\n\n- 웹 사이트의 모바일 / 데스크톱 버전 간 전환 후 발행 페이지 코드 편집기 문제 수정\n\n- 데이터를 DOM에 직접 잘못 저장하여 성능을 초래하는 getMarkdown () 메서드의 버그 수정 성능 저하 수정\n\n- '접힌 블록 자동 확장'을 끈 후 접힌 블록에서 번역 버튼이 표시되지 않는 문제 수정, @MoYuToGo의 피드백에 감사드립니다\n\n- 이론적으로 의미가 없으므로 이전에 가능한 체크 박스 상태를 선택 해제하도록 \"페이지 리소스가 완전히로드 될 때까지 기다리지 않음\"옵션의 이름을 변경\n\n- 많은 코드 구조를 조정\n\n- ** 많은 양의 스타일러스 사용자 정의 스타일을 사용하는 경우 조정해야 할 수 있습니다 **\n\n- 기타 몇 가지 조정 및 개선\n\n\n\n------\n\n\n\n- 피드백에 대한 @caoxuanming 덕분에 ChatGPT 구성 패널이 표시되지 않는 문제 수정\n\n- @liuhao6 덕분에 기본적으로 활성화되는 구성 스위치 \"마우스 스크롤 잠금\"을 추가했습니다. 제안\n\n\n\n------\n\n\n\n- @wrkwrk의 제안 덕분에 clist 등급 API를 v4로 업데이트하고, 제목 페이지의 데이터 가져 오기 방법을 API를 통해 가져 오도록 조정\n\n- 기본적으로 켜져있는 ChatGPT 번역 \"스트리밍 전송\" 옵션 추가\n\n- Google 번역 결과가 비어있는 문제 수정. shicxin의 피드백 덕분에\n\n- \"코드 제출을 두 번 확인할지 여부\" 설정 스위치 추가, 기본적으로 켜짐 @Rikkual의 제안 덕분에\n\n- 전체 주제 설정 페이지에 작은 영역 버튼 추가\n\n- 전체 주제 설정 페이지 오른쪽 클릭 시 인쇄 시 번역 결과가 표시되지 않는 문제 수정 @zfs732의 피드백 덕분에\n\n\n\n------\n\n\n\n- 온라인을 지원하는 코드 편집기를 주제 페이지 하단에 추가했습니다. 코드 테스트, 코드 제출 등 정보 페이지를 읽어주세요\n\n- 스크립트 버튼 삽입 및 번역 결과가 주제 설명으로 변경되는 문제 수정\n\n- 중국어 버전의 콤보 매시업 관리 페이지 개선\n\n- 기본적으로 비활성화 된 \"짧은 텍스트 자동 번역\"기능 추가\n\n- 번역 대기 간격 구현 개선, 이제 대기 간격이 전 세계적으로 유효합니다\n\n- \"대상 영역 범위 표시\"구현 개선\n\n- 다크 모드 개선, 샘플 요소의 호버링을 개선합니다. 샘플 요소의 호버 스타일 개선, 피드백을 주신 @SUPERLWR 덕분에\n\n- 설정 패널 옵션 추가: 번역 - 텍스트에서 \\*\\* 필터링, 피드백을 주신 @Dog_E, CreMicro 덕분에\n\n- '로딩 알림 표시' 기능을 끈 후 클리스트 등급이 제대로 표시되지 않는 문제를 수정했습니다. 피드백을 보내주신 Vistarin님께 감사드립니다\n\n- 기타 개선 및 수정 사항"
}