{
    "lastVersion": "1.20.0",
    "1.20.0": "- Contribución\n\n- Añadida la función personalizada \"Color del texto de traducción\", que permite configurar el color del texto resultante de la traducción en los ajustes, gracias a la contribución de **@wrk-123** - Añadido el atajo de teclado Ctrl+Enter para enviar código, gracias a la contribución de **@wrk-123**\n\n- Corregido el problema de los saltos de línea ` <br>` que faltaban en la conversión MarkDown, gracias a la contribución de **@wrk-123** - Corregido el problema del escape de caracteres por HTML (p. ej. ` ` ` `) al copiar MarkDown. Contribuciones\n\n- Corregido el escape de caracteres por HTML al copiar MarkDown (p.ej. `&lt;` `&gt;`), gracias a **@wrk-123** Contribuciones\n\n- Corregido el no filtrado de etiquetas ` <style>` al convertir MarkDown\n\n- Corregida la regla de sustitución de corchetes chinos que provoca errores de sintaxis en los enlaces Markdown, gracias a **@wrk-123** Contribuciones\n\n- Corregida la pérdida de código de estado HTTP en YouDao Translator, gracias a **@wrk-123** Contribuciones Lógica de juicio de código de estado HTTP en Youdao Translator, gracias a **@wrk-123** por contribuir\n\n- Arreglar problema de validación humana de CloudFlare, gracias a **@wrk-123** por contribuir\n\n- Arreglar cambios de capa redundantes, gracias a **@wrk-123** por contribuir\n\n- Mejora del elemento button añadiendo el atributo `type='button'` para evitar\n\n- Mejorar la traducción del texto del botón de copia en estado desactivado\n\n- Mejorar la construcción del formulario de envío de código, simplificar la estructura del código\n\n- Mejorar la decisión de tema no encontrado al saltar a Luogu, gracias a la contribución de **@wrk-123**\n\n- Mejorar las reglas de localización del sitio web, gracias a la contribución de **@qjwh**, **@nr0728**, **@wrk-123**. Contribuciones",
    "1.19.0": "- Se ha eliminado la dependencia del repositorio de scripts Greasyfork\n\n- Se ha cambiado la fuente de actualización predeterminada a AliCloud OSS\n\n- Se ha solucionado un problema de estilo incorrecto de los botones en algunas páginas de título\n\n- Mejoras：Ajuste de las palabras de aviso predeterminadas de GPT",
    "1.18.0": "\n\n\n\n\n\n\n\n\n\n- Añadir la opción \"Comprobador de resultados de pruebas de muestra\" - Añadir la función \"Mostrar lista del mismo tema\", gracias a la contribución de **@wrk-123** - Solucionar el problema de que el embellecimiento de bloques de código no cambiaba el tema correctamente cuando el modo oscuro es \"Seguir sistema\" - Solucionar el problema del error de traducción Arigatou - Solucionar el problema de que fallaba el intervalo de espera en el modo \"Traducción segmentada\" - Solucionar el problema que existe al consultar el saldo de la API.\n\n\n\nGracias a la contribución de **@x1uc** - Arreglar el problema de conflicto de nombres de clases de superposición - Mejorar las reglas de localización del sitio web, gracias a la contribución de **@nr0728**, **@user111192**, y **@qjwh**."
}