{
    "lastVersion": "1.17.0",
    "1.17.0": "- ** Sostituire il CDN del repository pubblico con [SUSTech Mirror] (https://mirrors.sustech.edu.cn/help/cdnjs.html), vedere [issue] (https://github.com/beijixiaohu/OJBetter/issues/151) per il motivo.\n\n\n\n\n\n\n\n** - Correggere il problema che il pulsante \"Espandi/Colla\" del codice della pagina delle sottomissioni non è valido - Adattare la struttura del layout della pagina delle impostazioni.",
    "1.16.1": "- Risolvere un problema con gli errori di localizzazione del sito web",
    "1.16.0": "\n\n\n\n\n\n\n\n\n\n- Aggiunte le opzioni \"ChatGPT Translation Prompt Custom\" e \"As System Prompt\" Grazie a **@Dawn-Xu-helloworld** per la collaborazione - Aggiunto popup di conferma del commit del codice per mostrare il nome dell'argomento, - Aggiunta l'opzione di traduzione automatica - Aggiunta l'opzione Sample by auto-commit (disattivata per impostazione predefinita) - Sostituita l'interfaccia \"Youdao Translator\" - Corretti i simboli `` nell'abbellimento dei blocchi - Corretto il problema per cui il tema impostato per seguire non veniva applicato correttamente nell'editor Monaco - Corretto il LaTeX tra le righe che non applicava correttamente il tema&nbsp;\n\n\n\n\n\n\n\nCorreggere il simbolo ` nell'abbellimento dei blocchi di codice - Correggere l'editor di Monaco che non applicava correttamente il tema quando il tema era impostato su \"follow\" Grazie a **@cscnk52** per il contributo - Correggere la sostituzione LaTeX tra le righe in modo corretto, correggere il problema delle prestazioni con le regolarità correlate - Correggere l'errore \"avvolgi i vecchi risultati\" durante la ritraduzione - Correggere il mancato filtraggio dei tag di script durante la conversione dei tag MarkDown\n\n\n\n\n\n- Corretti alcuni concorsi che non saltavano a Logu - Cambiati i colori dei voti della lista con le regole di colore di AtCoder - Usato polyfill per la compatibilità con i browser che non supportano il metodo dialog.showModal() (es. Firefox79)"
}