{
    "common": {
        "title": "Achèvement personnalisé",
        "name": {
            "label": "Remarques.",
            "placeholder": "Veuillez donner un nom de note pour cette configuration personnalisée"
        },
        "choose": {
            "label": "Activer ?"
        },
        "genre": {
            "label": "Format du modèle",
            "tipText": "<p>Le format monaco prend en charge presque tous les attributs du <a target=\"_blank\" href=\"https://microsoft.github.io/monaco-editor/docs.html#interfaces/languages.CompletionItem.html\">CompletionItem</a> en monaco, (note : l'attribut range n'est pas nécessaire, le script le calcule et l'ajoute automatiquement)</p><p>Le format ace ne prend en charge qu'un nombre limité d'attributs des compléteurs en ace : <code>caption</code>,<code>value</code>, qui sont automatiquement convertis par le script au format monaco</p><p>specifics. Vous pouvez lire les instructions sur la page du script</p>"
        },
        "language": {
            "label": "Langues applicables"
        },
        "jsonurl": {
            "tipText": "<p>Lorsque OJBetter_Bridge est activé, il répond à une requête GET<code>/mycomplet/*</code>, et renvoie le contenu du fichier portant le même nom qui se trouve dans le dossier<code>mycomplet</code></p><p>Il vous suffit donc de placer votre fichier JSON dans le dossier <code>/mycomplet</code> pour y accéder localement,</p><p>Dans la configuration, vous devez remplir la forme de l'URL : </p><p><code>http:/ / / / //mycomplet/xxx json  /127.0.0.1:2323/mycomplet/xxx.json</code></p>",
            "alert": "<p>Le script fera entièrement confiance à vos données JSON sans contrôles et vérifications supplémentaires, n'ajoutez donc pas d'URL JSON provenant de sources inconnues,</p><p>Les données spécialement construites peuvent perturber le fonctionnement normal du script ou même exécuter d'autres codes malveillants</p>",
            "placeholder": "En forme de http://127.0.0.1:2323/mycomplet/xxx.json"
        }
    }
}